backend/app/controllers/api/v1/fields_controller.rb

SELECT "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "fields" SET "name" = ?, "updated_at" = ? WHERE "fields"."id" = ?  [["name", ""], ["updated_at", "2020-03-17 05:14:07.896309"], ["id", 1]]
UPDATE "maps" SET "coordinates" = ?, "updated_at" = ? WHERE "maps"."id" = ?  [["coordinates", "122766"], ["updated_at", "2020-03-21 04:04:57.303906"], ["id", 1]]
UPDATE "fields" SET "name" = ?, "coordinates" = ?, "updated_at" = ? WHERE "fields"."id" = ?  [["name", ""], ["coordinates", "32.9924145,-81.016398"], ["updated_at", "2020-03-18 03:49:38.419423"], ["id", 1]]
---
  def update
    field = Field.find_by(id: params[:id])
    map = Map.find_by(id: params[:id])

    field.update(field_params)
    map.update(map_params)

    if field.save && map.save