backend/app/controllers/api/v1/fields_controller.rb

    def update
      @field = Field.find_by(params[:id])
---
SELECT "fields".* FROM "fields" WHERE (1) LIMIT ?  [["LIMIT", 1]]