backend/app/controllers/api/v1/fields_controller.rb

SELECT "fields".* FROM "fields"
---
    def index
      @fields = Field.all

UPDATE "fields" SET "name" = ?, "coordinates" = ?, "updated_at" = ? WHERE "fields"."id" = ?  [["name", ""], ["coordinates", ""], ["updated_at", "2020-03-12 00:19:22.119895"], ["id", 1]]
INSERT INTO "fields" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "silo_adjacent"], ["created_at", "2020-03-21 01:02:44.826361"], ["updated_at", "2020-03-21 01:02:44.826361"]]
UPDATE "fields" SET "id" = ?, "updated_at" = ? WHERE "fields"."id" = ?  [["id", 3], ["updated_at", "2020-03-09 02:58:20.440752"], ["id", 1]]
---
    def update
    @field.update(field_params)
      if @field.save

SELECT "fields".* FROM "fields" WHERE "fields"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def find_field
      @field = Field.find_by(id: params[:id])