backend/app/controllers/api/v1/maps_controller.rb

def index
    maps = Map.all
---
SELECT "maps".* FROM "maps"

 def create
    map = Map.create(map_params)

    if map.field_id != 1
        map.field_id = 1
    else map.field_id += 1
    end

    if map.save
---
INSERT INTO "maps" ("coordinates", "field_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["coordinates", "1231254112312213"], ["field_id", 11], ["created_at", "2020-03-20 04:38:00.194247"], ["updated_at", "2020-03-20 04:38:00.194247"]]
INSERT INTO "fields" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "silo_adjacent2"], ["created_at", "2020-03-25 15:51:46.785120"], ["updated_at", "2020-03-25 15:51:46.785120"]]
INSERT INTO "maps" ("coordinates", "field_name", "field_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["coordinates", "32.989181, -81.015845"], ["field_name", "silo_adjacent2"], ["field_id", 1], ["created_at", "2020-03-21 02:47:49.363225"], ["updated_at", "2020-03-21 02:47:49.363225"]]
UPDATE "maps" SET "field_id" = ?, "updated_at" = ? WHERE "maps"."id" = ?  [["field_id", 2], ["updated_at", "2020-03-22 05:16:07.647649"], ["id", 1]]

  def update
    field = Field.find_by(id: params[:id])
    map = Map.find_by(name: params[:name])
    map.update(map_params)

    if map.save
---
SELECT "fields".* FROM "fields" WHERE "fields"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "maps".* FROM "maps" WHERE "maps"."name" IS NULL LIMIT ?  [["LIMIT", 1]]
UPDATE "maps" SET "lat" = ?, "lng" = ?, "field_name" = ?, "updated_at" = ? WHERE "maps"."id" = ?  [["lat", "33.12321"], ["lng", "33.12321"], ["field_name", ""], ["updated_at", "2020-03-23 04:00:44.453444"], ["id", 1]]
UPDATE "maps" SET "coordinates" = ?, "updated_at" = ? WHERE "maps"."id" = ?  [["coordinates", "1231325"], ["updated_at", "2020-03-22 07:15:27.110694"], ["id", 1]]