backend/app/controllers/api/v1/maps_controller.rb

  def update
    map = Map.find_by(id: params[:id])
---
SELECT "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]